---
kind: method
id: M:Autodesk.Revit.DB.CopyPasteOptions.#ctor
source: html/eb110787-b031-5307-c083-14cb5d920617.htm
---
# Autodesk.Revit.DB.CopyPasteOptions.#ctor Method

Creates a new instance of a CopyPasteOptions object.

## Syntax (C#)
```csharp
public CopyPasteOptions()
```